---
type: Polyloop
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 6
tags: [revit-api, class]
---

# Polyloop

`Autodesk.Revit.DB.Analysis.Polyloop` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ComputeArea | 2012 | `public double ComputeArea ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetPoints | 2012 | `public IList < XYZ > GetPoints ()` |
| Property | Centroid | 2012 | `public XYZ Centroid { get ; }` |
| Property | Direction | 2012 | `public XYZ Direction { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |